namespace WebApplication1
{
    public static class Messages
    {
        public static readonly string aboutQuestion = "- Вопрос на любую тему должен ДЕЙСТВИТЕЛЬНО вас волновать (требовать ответа)\r\n" +
                                                      "- Спрашивать только про себя («хочу что бы бабушка выздоровела» - неверно/ \r\n" +
                                                      "Верный формат: «Что Я могу сделать, что бы бабушке стало легче» и т.п.)\r\n" +
                                                      "- Вопрос в открытой форме, \r\n" +
                                                      "не подразумевающий ответ ДА или НЕТ";

        public static readonly string question = "Напишите свой вопрос (в конце обязательно должен быть знак вопроса)";
        public static readonly string letsStart = "Сейчас вам предстоит сделать 6 бросков додекайдера, чтобы пройти оракула.🌜Смелее!🌛";

        public static readonly string link = "https://t.me/tambolio";

        public static readonly string[] messagesList = 
        {
            "🧳Добро пожаловать!\r\n" +
            "На связи личный помощник и ученик сталкера👾",

            "<b>Сталкер разрешает мне:</b>\r\n" +
            "💌рассказывать Пилигримам о Тамболии\r\n" +
            "🗓помогать записываться на ближайшие игры \r\n" +
            "📝помогать Пилигримам отвечать на любые вопросы",

            "Хотите <b>узнать больше о игре \r\n" +
            "в тамболию</b> или готовы <b>задать вопрос?</b>"
        };

        public static readonly string[] aboutTambolia = 
       {    "🗺<b>Тамболия - это Карта человеческих состояний, представленная в видя коллективной \r\n" +
            "настольной игры,\r\n" +
            "которая помогает найти ответы\r\n" +
            "на самые разные вопросы в жизни, \r\n" +
            "отношениях, бизнесе.</b>\r\n" +
            "\r\n«Кто я? Что я здесь делаю? В чем мой Дар?\r\nМое Предназначение? \r\n" +
            "Как найти любовь? \r\n" +
            "Как организовать проект или собственный бизнес? \r\n" +
            "На чем сосредоточить внимание в стратегии?»\r\n" +
            "\r\nКарту Тамболии открыл американский ученый и буддийский монах Джеймс Тейлор Маршалл \r\n" +
            "40 лет назад. В основе открытия Джеймса лежат принципы квантовой механики и тибетских \r\n" +
            "мандал, которым более 2500 лет.",

            "⏰Начало 1970-х в США — время новой волны, хиппи, нон-конформизма, свободы нравов.\r\n" +
            "Во время учебы в университете Сонома будущий физик Джеймс выбирает интересную для себя \r\n" +
            "тему выпускной работы: \r\n " +
            "<u>«Откуда приходят решения?»</u>\r\n" +
            "Научный руководитель доктор Гринн советует студенту обратить внимание на древние \r\n" +
            "практики\r\n" +
            "и использовать для анализа опыт накопленный не только в научной сфере. \r\n" +
            "\r\n🕉Весной 1971 года перебирается в тибетский монастырь\r\n" +
            "Падма Линг. Там Джеймс Тейлор Маршалл становится Йоги Яшей.\r\n" +
            "В монастыре он проводит 4 года, погружаясь в незнакомый западному уму мир буддийских" +
            "монахов, изучая мандалы, медитации, практики работы с энергиями в своем теле. \r\n" +
            "\r\n🛣Последующие 30 лет он странствует по свету, по крупицам собирая знания, которые были \r\n" +
            "неправильно интерпретированы, незаслуженно забыты.\r\n" +
            "\r\n💡Яша представил разгадку в виде древних буддийских изображений\r\n" +
            "- мандал.\r\n" +
            "В основу он положил пиктограммы Колеса Жизни и Дерева Жизни,\r\n" +
            "которые совершенно удивительным образом оказались у него в руках.\r\n" +
            "Он взял их себе и попытался \r\n" +
            "разобраться, что же древние учителя зашифровали в сложных символах.\r\n " +
            "       🔵\U0001f7e2\U0001f7e1🔴\r\n"+
            "Результатом его усилий стала Карта человеческого состояния, свободного от невежества и \r\n" +
            "предрассудков.\r\n" +
            "Она содержит в себе ключ к духовному пути для каждого из нас. \r\n" +
            "Мы называем ее Картой Тамболии, универсальным резервуаром ответов, решений и возможностей.",

            "<b>Сталкер</b> = Ведущий игры \r\n" +
            "<b>Пилигрим</b> = участник игры задающий вопрос\r\n" +
            "<b>Додекаэдр</b> = 12 гранный кубик четырех цветов ",

            "Прямо сейчас мы сможем начать первый этап игры\r\n " +
            "    <b>🔮Оракул</b>\r\n" +
            "Все определяют Условия и Информация.\r\n" +
            "Оракул Тамболии разъясняет Условия, касающиеся вашего Вопроса. \r\n" +
            "Вы 6 раз подряд бросаете игральную кость и выясняете эти Условия. \r\n" +
            "После того как все определили свою начальную позицию (на 6м броске), игроки переходят на этап «Великая Иллюзия»."
        };

        public static readonly string[] lastMessages = 
        {
            "🚪Ступень на выбранном Пути - это отправная точка путешествия Пилигрима по Карте Тамболии.",

            "🕵‍Ваш сталкер уже раскрыл карту и ждет встречи с Вами.\r\n" +
            "Готовы ли Вы сделать первый шаг на пути к ответам?\r\n" +
            "🗺 Путешествие начинается!"
        };

        public static readonly string[] aboutDiceRolls =
        {
            "<u>Первый бросок</u> называется - <u>Основной мотив</u> \r\n " +
            "💭Подумайте о своём вопросе и бросьте додекайдер",

            "<u>Второй бросок</u> называется - <u>Качество получаемого опыта</u> или <u>степень вовлеченности</u>\r\n" +
            "💭Подумайте о своём вопросе и бросьте додекайдер",

            "<u>Третий бросок</u> называется - <u>Окружение и текущие обстоятельства, связанные с вашим Вопросом</u>\r\n" +
            "💭Подумайте о своём вопросе и бросьте додекайдер",

            "<u>Четвертый бросок</u> называется - <u>Звенья цепи, связывающие Вас с вашим вопросом.</u> \r\n" +
            "💭Подумайте о своём вопросе и бросьте додекайдер",

            "<u>Пятый бросок</u> называется - <u>Выбранный Путь выхода</u>\r\n" +
            "💭Подумайте о своём вопросе и бросьте додекайдер"

        };

        public static readonly string[][] unswers =
        {
            new[]
            {
                "<u>Эмоции</u>\U0001f7e2",
                "<u>Равновесие</u>🔵",
                "<u>Обман</u>\U0001f7e1",
                "<u>Желание</u>🔴"
            },
            new[]
            {
                "<u>Размышление (Разрушение)</u>\U0001f5a4\r\n" +
                "Иногда в голове так много мыслей, идей, мыслей, убеждений, что для того, чтобы двигаться дальше, нужно отпустить некоторые из них.\r\n" +
                "Сейчас вы размышляете, как это можно сделать.",

                "<u>Размышление (Созидание)</u>🤍\r\n" +
                "Иногда у вас есть проект, но вы не знаете, с чего начать. Сейчас вы размышляете,как это сделать.",

                "<u>Сомнения (Разрушение)</u>\U0001f5a4\r\n"+
                "Сомнения - это опасения, которые вы испытываете перед новым опытом,\r\n" +
                "пространством или проектом. Часто сомнения мешают нам расстаться со старым.",

                "<u>Надежда (Созидание)</u>🤍\r\n"+
                "Надежда - это ожидание чего-то, что пока не произошло в действительности.\r\n" +
                "Иногда надеяться можно вечно. Иногда надеяться нужно вечно.",

                "<u>Избыток (Разрушение)</u>\U0001f5a4\r\n" +
                "Избыток - это излишек энергии и вещей, которые образуются когда вы не в состоянии\r\n" +
                "распределить их. Вы медлите с решениями, и быстро накапливаете то, от чего следует избавляться.",

                "<u>Ресурсы (Созидание)</u>🤍\r\n"+
                "Ресурсы - это почва под ногами и еда в холодильнике. Это умения и способности, благодаря которым\r\n" +
                "у вас есть все, чтобы воплощать задуманное в Жизнь.",

                "<u>Застой (Разрушение)</u>\U0001f5a4\r\n"+
                "Застой - состояние, в котором вам кажется, что ничего не происходит. На самом деле, это может быть не так.\r\n" +
                "Часто люди не замечают даже очевидного. Но не волнуйтесь, это рано или поздно случается с каждым.",

                "<u>Продвижение (Созидание)</u>🤍\r\n"+
                "Случается то, что вы хотели. Другие заметили и оценили вашу разумность.\r\n" +
                "Вас поддерживают.",

                "<u>Распад (Разрушение)</u>\U0001f5a4\r\n"+
                "Магия застоя сработала. Сейчас все само разваливается на части, и вам не нужно этому помогать.\r\n" +
                "Однако не всегда легко невозмутимо наблюдать за тем, как все рушится.",

                "<u>Сила (Созидание)🤍</u>\r\n"+
                "Вы достигли своей мечты, все на своих местах и работает.\r\n" +
                "Вы руководите процессом, и все сейчас идет правильно.",

                "<u>Хаос (Разрушение)</u>\U0001f5a4\r\n"+
                "Мы расчистили пространство, и все вернулось к своему начальному состоянию.\r\n" +
                "Из хаоса все рождается. Это прекрасная почва для новых идей",

                "<u>Чудесное (Созидание)</u>🤍\r\n"+
                "Чудесное - это венец ваших стремлений. Однако часто, оказавшись здесь, приходит время для чего-то еще." +
                " Оставайтесь здесь столь долго, сколько сможете.\r\n" +
                "Если, конечно, сможете."
            },
            new[]
            {
                "<u>Лучшее из возможных мест</u>\r\n"+
                "Возможных мест может быть несколько, но это лучшее для вас на настоящий момент.",

                "<u>Вы - главный</u>\r\n" +
                "Вы все контролируете. Это также означает, что если вы совершите ошибку,\r\n" +
                "все узнают об этом, включая вас самих.",

                "<u>Недостигнутое</u>\r\n" +
                "Вы сделали все возможное, но это не срабатывает.\r\n" +
                "В какой-то момент вы жалеете, что во все это ввязались.",

                "<u>Совершенно нереалистичное</u>\r\n" +
                "Вас контролируют обстоятельства, которыми вы сами не в состоянии руководить.\r\n " +
                "Вы не знаете, как выбраться из сложившейся ситуации",

                "<u>Инстинктивная природа</u>\r\n" +
                "Вам нужно отказаться от своего аналитического ума, чтобы узнать вашу инстинктивную природу.\r\n" +
                "Почти всегда это трудно.",

                "<u>Духовные поиски</u>\r\n" +
                "Когда рушится все остальное, всегда остается возможность уйти в духовное путешествие.\r\n " +
                "Иногда... этот выход единственный",

                "<u>Воплощение</u>\r\n" +
                "Воплощение включено сюда, потому что некоторые захотят остаться и медитировать в новых для них состояниях.\r\n" +
                "Во время медитации можно научиться многим необычным вещам, но не все они и не всегда работают в обычной жизни.\r\n" +
                "Понимание, которое вы получаете в разных воплощениях, довольно убедительное, хотите вы того или нет.",

                "<u>Заблуждение</u>\r\n" +
                "Для многих заблуждение представляется чем-то далеким и не имеющим к ним отношения. \r\n" +
                "Все проще: отказываясь извлекать уроки из своих иллюзий, вы прямиком отправляетесь в Заблуждение.",

                "<u>Мистический путь</u>\r\n" +
                "Мистический путь непрост. Многие стараются обходить его стороной, не без веских причин.\r\n" +
                "Чем увереннее вы шагаете по этому Пути, тем больше наживете недоброжелателей.",

                "<u>Организационный путь</u>\r\n" +
                "На организационном пути нам нужно взаимодействовать внутри других систем: бизнеса, семьи, дружбы.\r\n" +
                "Отношения с другими априори непредсказуемы, и поэтому если хотите справиться с ними - удачи",

                "<u>Личностный путь</u>\r\n" +
                "Этот путь самый популярный в Великой Иллюзии. Прежде чем критиковать или хвалить других, нужно разобраться с собой.\r\n" +
                "Если пренебречь собственным положением, можно совершить ошибки, которые будут иметь неприятные последствия.",

                "<u>Внутренний дом</u>\r\n" +
                "Лучше всего увидеть внутренний дом вы сможете из его центра.\r\n " +
                "Часто наше пространство в беспорядке. В нем хранится много лишнего."
            },
             new[]
             {
                 "<u>Внешность</u>\r\n" +
                 "Внешний вид - это ваш экстерьер. Обычно вы прибираете его, когда хотите показаться другим людям лучше, чем вы есть на самом деле.\r\n" +
                 "Однако нужно помнить, чужой человек скользит взглядом по незнакомой поверхности. Он не смотрит внутрь.",

                 "<u>Тревожность</u>\r\n" +
                 "Тревожность - это состояние, в котором вы понимаете, что что-то ускользнуло от вашего внимания.\r\n" +
                 "Поскольку таких вещей обычно очень много, у нас всегда есть повод чувствовать себя встревоженными",

                 "<u>Лицемерие</u>\r\n" +
                 "Лицемерие возникает, когда вы говорите одно, а думаете совсем другое.\r\n" +
                 "Хотя если бы все были откровенными, вряд ли это нравилось.",

                 "<u>Привязанности</u>\r\n" +
                 "Вы связаны с тем, что делаете. Это удерживает вас.\r\n" +
                 "Привязанности могут быть любыми. Выявить их порой довольно сложно.",

                 "<u>Нетерпеливость</u>\r\n" +
                 "Нетерпеливость - это состояние, когда желания опережают умения.\r\n " +
                 "Помните, вы в этом не виноваты. Вы поступаете идеально для своего текущего состояния.",

                 "<u>Страх</u>\r\n" +
                 "Страх - это ложное свидетельство, которое кажется правдой.\r\n " +
                 "Работает почти всегда, кроме тех случаев, когда серьезно следует испугаться.",

                 "<u>Нерешительность</u>\r\n" +
                 "Нерешительность можно описать, как вынужденную остановку. Ум тормозит вас.\r\n" +
                 "Помните, нерешительность иногда гораздо хуже, чем принятие неправильного решения.",

                 "<u>Осуждение</u>\r\n" +
                 "Вам когда-то сказали, чтобы вы не судили других людей.\r\n" +
                 "Но и это высказывание является суждением. Не стоит ему следовать.",

                 "<u>Гнев</u>\r\n" +
                 "Иногда, чтобы закончить какую-ту задачу, вам нужно разозлиться. Гнев может быть единственным правильным решением.\r\n " +
                 "Но не позволяйте гневу тотально влиять на вас.",

                 "<u>Лень</u>\r\n" +
                 "Лень наступает, когда вы не хотите сделать что-то, что, возможно, делать и не следует.\r\n" +
                 "Проблема возникает тогда, когда это замечает кто-то еще.",

                 "<u>Сожаление</u>\r\n" +
                 "Сожаление наступает в тот момент, когда вы решаете сделать выбор и остановиться на чем-то одном.\r\n" +
                 "Но вспомните, что у соседа-то трава зеленее. Лучшее всегда по другую сторону забора.",

                 "<u>Здоровье</u>\r\n" +
                 "Здоровье может быть физическое, умственное, эмоциональное.\r\n" +
                 "Ваше собственное и других людей. Здоровье семьи, коллектива, взаимоотношений.\r\n " +
                 "Иногда следует обращать внимание на здоровье, потому что никто не сделает этого кроме вас."
             },
             new[]
             {
                 "🔵<u>Синий</u> - Мистический путь\r\n" +
                 "Вам предстоит слушать свое сердце, замечать знаки и иметь дело с силами," +
                 "которые вам пока не совсем понятны.",

                 "🔴<u>Красный</u> - Организационный путь\r\n" +
                 "На этом пути вы будете связаны с другими людьми - близкими, семьей, компанией и любой организацией.",

                 "\U0001f7e1<u>Желтый</u> - Личностный путь\r\n" +
                 "Путь вашего личностного роста, развития.",

                 "\U0001f7e2<u>Зеленый</u> - Путь Внутреннего дома\r\n" +
                 "На этом пути вы построите свой Внутренний дом, от фундамента до крыши. Этот путь связан со всем вашим существом."
             }
        };
    }
}
